### Data Series

In [3]:
import pandas as pd
import numpy as np

# criar serie atraves de lista
    # serie faz parte do PANDAS
    # da para convert uma coluna de TAB em Serie
s = pd.Series([1,2,3,4,5])
print(s)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
# trans indice em letras
    # segundo item é o tipo de index=
    # da para usar em MES também 
s = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
print(s)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [11]:
# chamar por INDEX
s['c']
# estrut: lib.type(VALOR do INDEX)

np.int64(3)

In [12]:
# create Random Number with NUMPY
s = pd.Series(np.random.uniform(0,1000), index={f'{i}' for i in range(1,1000)})

### Data Frames

In [31]:
import pandas as pd

data = {
    "Nome": ["Ana Silva", "Carlos Souza", "João Pereira", "Luciana Costa"],
    "Idade": [28, 42, 26, 83],
    "Naturalidade": ["SP", "RJ", "SSA", "POA"],
}

df = pd.DataFrame(data)

display(df)

0        Ana Silva
1     Carlos Souza
2     João Pereira
3    Luciana Costa
Name: Nome, dtype: object

In [26]:
# retornar o VALOR que ESTÁ NA CONDIÇÃO/FILTRO
# para fazer filtros, crie a estrut condicional, cerca de [] e coloca no print com o nome do database antes

display(df[df['Idade'] > 20])

            Nome  Idade Naturalidade
0      Ana Silva     28           SP
1   Carlos Souza     42           RJ
2   João Pereira     26          SSA
3  Luciana Costa     83          POA

In [32]:
# filtrar por nome
display(df[df['Nome'] == "Ana Silva"])

        Nome  Idade Naturalidade
0  Ana Silva     28           SP

In [34]:
# locate by index
print(df.loc[1])
# by range
print(df.loc[1:3])

Nome            Carlos Souza
Idade                     42
Naturalidade              RJ
Name: 1, dtype: object
            Nome  Idade Naturalidade
1   Carlos Souza     42           RJ
2   João Pereira     26          SSA
3  Luciana Costa     83          POA

In [35]:
# pegar registros até
df.head()

            Nome  Idade Naturalidade
0      Ana Silva     28           SP
1   Carlos Souza     42           RJ
2   João Pereira     26          SSA
3  Luciana Costa     83          POA